export const trainLineParams = {
  //東京メトロ
  銀座線: {
    color: "#FF9500",
  },
  丸ノ内線: {
    color: "#F62E36",
  },
  丸ノ内線分岐線: {
    color: "#F62E36",
  },
  日比谷線: {
    color: "#B5B5AC",
  },
  東西線: {
    color: "#009BBF",
  },
  千代田線: {
    color: "#00BB85",
  },
  有楽町線: {
    color: "#C1A470",
  },
  半蔵門線: {
    color: "#8F76D6",
  },
  南北線: {
    color: "#00AC9B",
  },
  副都心線: {
    color: "#9C5E31",
  },
  //都営地下鉄
  浅草線: {
    color: "#FF535F",
  },
  三田線: {
    color: "#0067B0",
  },
  新宿線: {
    color: "#9FB01C",
  },
  大江戸線: {
    color: "#CF3366",
  },
  荒川線: {
    color: "#D04172",
  },
  日暮里舎人ライナー: {
    color: "#85CA58",
  },
  //JR
  東北新幹線: {
    color: "#008000",
  },
  上越新幹線: {
    color: "#008000",
  },
  東海道新幹線: {
    color: "#0000FF",
  },
  八高線: {
    color: "#A09D95",
  },
  山手線: {
    color: "#85C023",
  },
  中央線: {
    color: "#EB5C01",
  },
  吾妻線: {
    color: "#008689",
  },
  総武線: {
    color: "#FFE500",
  },
  伊東線: {
    color: "#FF9845",
  },
  五日市線: {
    color: "#EB5C01",
  },
  常磐線: {
    color: "#0071C5",
  },
  常磐線各駅停車: {
    color: "#9E9E9F",
  },
  常磐線快速: {
    color: "#00C18A",
  },
  上越線: {
    color: "#00ACD1",
  },
  鹿島線: {
    color: "#A85F12",
  },
  川越線: {
    color: "#00AC84",
  },
  // 東北線: {
  //   color: "#000000",
  // },
  京葉線: {
    color: "#CF1225",
  },
  久留里線: {
    color: "#00C3A7",
  },
  武蔵野線: {
    color: "#EB5C01",
  },
  南武線: {
    color: "#FFE400",
  },
  成田線: {
    color: "#00BB85",
  },
  青梅線: {
    color: "#EB5C01",
  },
  相模線: {
    color: "#008689",
  },
  埼京線: {
    color: "#00AC84",
  },
  根岸線: {
    color: "#00A7E3",
  },
  湘南新宿ライン: {
    color: "#DE0515",
  },
  総武本線: {
    color: "#FDD700",
  },
  総武快速線: {
    color: "#0074BE",
  },
  相鉄直通線: {
    color: "#00C3A7",
  },
  外房線: {
    color: "#F22335",
  },
  高崎線: {
    color: "#FF9845",
  },
  東金線: {
    color: "#B31C31",
  },
  // 東海道線: {
  //   color: "#FF9845",
  // },
  鶴見線: {
    color: "#FFE500",
  },
  内房線: {
    color: "#0071C5",
  },
  宇都宮線: {
    color: "#FF9845",
  },
  横浜線: {
    color: "#85C023",
  },
  横須賀線: {
    color: "#0074BE",
  },
  西武新宿線: {
    color: "#01A6BF",
  },
  拝島線: {
    color: "#01A6BF",
  },
  池袋線: {
    color: "#EF7A00",
  },
  西武有楽町線: {
    color: "#EF7A00",
  },
  豊島線: {
    color: "#EF7A00",
  },
  多摩川線: {
    color: "#EF7A00",
  },
  狭山線: {
    color: "#EF7A00",
  },
  国分寺線: {
    color: "#1EAD4C",
  },
  山口線: {
    color: "#E83E2F",
  },
  多摩湖線: {
    color: "#F7AF0E",
  },
  多摩都市モノレール線: {
    color: "#ff6633",
  },
  京王線: {
    color: "#dd0076",
  },
  京王新線: {
    color: "#dd0076",
  },
  高尾線: {
    color: "#dd0076",
  },
  相模原線: {
    color: "#dd0076",
  },
  井の頭線: {
    color: "#000088",
  },
  小田原線: {
    color: "#2288cc",
  },
  多摩線: {
    color: "#2288cc",
  },
  江ノ島線: {
    color: "#2288cc",
  },
  東横線: {
    color: "#da0442",
  },
  東急多摩川線: {
    color: "#ae0378",
  },
  こどもの国線: {
    color: "#0068b7",
  },
  池上線: {
    color: "#ee86a7",
  },
  目黒線: {
    color: "#009cd2",
  },
  世田谷線: {
    color: "#fcc70d",
  },
  新横浜線: {
    color: "#890D84",
  },
  みなとみらい線: {
    color: "#09357f",
  },
  田園都市線: {
    color: "#20a288",
  },
  大井町線: {
    color: "#f18c43",
  },
  東上本線: {
    color: "#000099",
  },
  亀戸線: {
    color: "#0f6cc3",
  },
  野田線: {
    color: "#40B3E5",
  },
  伊勢崎線: {
    color: "#ff0000",
  },
  相鉄本線: {
    color: "#000080",
  },
  相鉄いずみ野線: {
    color: "#000080",
  },
  相鉄新横浜線: {
    color: "#000080",
  },
  京急本線: {
    color: "#00A3E4",
  },
  空港線: {
    color: "#00A3E4",
  },
  大師線: {
    color: "#00A3E4",
  },
  逗子線: {
    color: "#00A3E4",
  },
  久里浜線: {
    color: "#00A3E4",
  },
  京成本線: {
    color: "#15388B",
  },
  押上線: {
    color: "#15388B",
  },
  金町線: {
    color: "#15388B",
  },
  千葉線: {
    color: "#15388B",
  },
  千原線: {
    color: "#15388B",
  },
  新京成線: {
    color: "#ef59a1",
  },
  成田スカイアクセス線: {
    color: "#EC7B02",
  },
  つくばエクスプレス: {
    color: "#000080",
  },
  東葉高速線: {
    color: "#3fb036",
  },
  ゆりかもめ: {
    color: "#27404c",
  },
  東京モノレール羽田線: {
    color: "#019DE5",
  },
  千葉都市モノレール: {
    color: "#2843ba",
  },
  金沢シーサイドライン: {
    color: "#f68b1e",
  },
  りんかい線: {
    color: "#222D65",
  },
  江の島線: {
    color: "#ff0000",
  },
  横浜市営地下鉄ブルーライン: {
    color: "#0068b7",
  },
  横浜市営地下鉄グリーンライン: {
    color: "#00a968",
  },
}
